tutorials/10steadyBBEnclosed/0/Tlift0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tlift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
0.994867
0.984604
0.974362
0.964156
0.953988
0.943855
0.933751
0.923669
...
)
;

boundaryField
{
    Adiabatic_walls
    {
        type            zeroGradient;
    }
    Left
    {
        type            fixedValue;
        value           uniform 1;
    }
    Right
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
